---
kind: other
id: Methods.T:Autodesk.Revit.UI.Events.MessageBoxShowingEventArgs
source: html/e7298ee2-3e8f-b313-80b9-0a09a6d7c110.htm
---
# MessageBoxShowingEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.